[
    {
        "id": "8ed053a5-baa7-466c-b6ef-54b370f75316",
        "name": "Dr.Pankaj Singh Sisodiya",
        "department": "Computer Science & Engineering",
        "role": "HOD",
        "designation": "Head of Department",
        "image": "",
        "bio": "",
        "experience": "10+",
        "email": "",
        "qualification": "M.tech,PHD"
    },
    {
        "id": "4c385c10-0e99-4175-a8dd-93608509bfa9",
        "name": "DEEPIKA MALVIYA  ",
        "department": "Computer Science & Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_13_2026_08_17_37_PM.png",
        "bio": "Assistant Professor – Computer Science\r\nAcademic & Teaching Experience\r\n\r\nI have over 10 years of teaching experience across higher education institutions and reputed schools, with strong expertise in Computer Science and Information Technology.\r\n\r\nMillennium Group of Institution, Bhopal\r\nLecturer – Computer Science\r\nSeptember 2011 – October 2014\r\n\r\nGovernment Polytechnic College, Betul\r\nLecturer – Computer Science\r\nJuly 2015 – May 2017\r\n\r\nMadhyanchal Podar Learn School, Sonaghati, Betul\r\nTGT – Computer / IT\r\n3 Years\r\n\r\nShree Vinayakam Children Academy, Betul\r\nComputer Teacher – 1 Year\r\n\r\nSatpuda Valley Public School, Sonaghati, Betul\r\nComputer Teacher – 1 Year\r\n\r\nProjects Undertaken\r\n\r\nE-Ticketing System (Major Project – .NET):\r\nDesigned and implemented an automated e-ticketing system enabling users to generate tickets based on validated user information.\r\n\r\nOnline Voting System (Minor Project – .NET):\r\nDeveloped a secure online voting application with automated user authentication and vote management.\r\n\r\nIndustrial Training\r\n\r\n45 Days Industrial Training in .NET\r\nNet Guru Solutions, Bhopal\r\n\r\nResearch & Publication\r\n\r\n“Recent Trends in Cyber Criminology”\r\nPublished in HBRP Publications\r\n\r\nAreas of Interest\r\n\r\nComputer Science, Information Technology, .NET Technologies, Cyber Security, Academic Research\r\n",
        "experience": "10+ Year",
        "email": "",
        "qualification": ": BE, MTECH (CSE)"
    },
    {
        "id": "adcb20e0-a38c-4b3c-893a-6b8fa53ed548",
        "name": "Mr Nilesh Mishra",
        "department": "AI & Data Science",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_13_2026_08_21_21_PM.png",
        "bio": "Area of Specialization :- Internet of Things, Machine Learning.\r\nAcademic History, \r\n1)Completed Mtech. and Btech. from RTMNU Nagpur with an overall experience in teaching of more than 8 years.\r\n2)Has published 15+ research papers in various international Journals in the field of Internet of things, communication Electronics,WSN.\r\n3)Activily participated in Atal FDP and various conferences conducted by AICTE.\r\n4)Acting as a President of Institute Inovation council.\r\n5)Actings as a Incharge of Industry Institute Interaction cell.\r\n \r\n",
        "experience": "8+ years",
        "email": "",
        "qualification": "Mtech ,Btech"
    },
    {
        "id": "06af3e86-cfa4-4fe3-87a0-5b26f850a24b",
        "name": "Hemant Dawande",
        "department": "Mechanical Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_13_2026_08_23_12_PM.png",
        "bio": "Area of Specialization : Computer-Aided Design/ Computer-Aided Manufacturing\r\nAcademic History\r\nI am a Ph.D. pursuing scholar in Mechanical Engineering at G H Raisoni University, with an M.Tech degree from the University Institute of Technology, Barkatullah University, Bhopal (2013). I have 12 years of teaching experience and 1 year of industrial experience, demonstrating strong academic, administrative, and leadership competence.\r\nI have effectively served in key academic and administrative positions, including Head of the Department (Mechanical Engineering), Institute Project Coordinator, and Deputy Examination Controller, where I contributed to academic planning, examination management, accreditation activities, and institutional governance. My teaching philosophy focuses on outcome-based education, curriculum development, and student mentoring.\r\nMy research interests include CAD/CAM, ontology-based knowledge modeling, product design, manufacturing systems, and joining process selection for plastic assemblies. I have published research in reputed international journals, including “An Ontology-Based Knowledge Framework for Selection of Joining Process in Plastic Assembly” in Materials Today: Proceedings (2024), along with earlier publications on automotive braking materials, thermal conductivity analysis, and regenerative energy systems.\r\nI have participated in numerous AICTE-approved FDPs, STTPs, and national workshops conducted by IIT Kharagpur, IIT Kanpur, IIT Roorkee, IIT Bhilai, and NITTTR (Chennai and Bhopal). I am a Life Member of ISTE and a recipient of the SRIJAN Award 2020 for teaching excellence\r\n",
        "experience": "12+ year",
        "email": "",
        "qualification": "PhD Scholar,Mechanical Engineering"
    },
    {
        "id": "a1bbc9d8-7dad-4af6-88c6-7f49fc602a73",
        "name": "SONALI RATHORE",
        "department": "AI & Data Science",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_13_2026_08_25_46_PM.png",
        "bio": "I have over 5 years of teaching experience in higher education. Currently, I am serving as a faculty member at Shri Balaji Institute of Technology & Management, Betul (M.P.), where I have been teaching since 2023. Previously, I worked as a Guest Lecturer at Govt. S.V. Polytechnic College, Bhopal from 2016 to 2018, and as an Assistant Professor at Shashib College of Engineering, Bhopal during 2015–2016.\r\n\r\nResearch Area\r\n\r\nData Mining & Data Warehousing\r\n\r\nResearch Publications\r\n\r\nWeb-Based Real-Time AI Voice Agent Interview Platform, IJRAR, Vol. 12, Dec 2025\r\n\r\nSignature Verification System Using CNN, IJIRMPS, Vol. 13, Issue 2, Mar–Apr 2025\r\n\r\nStudent Feedback Classification Using Random Forest, IJSDR, Vol. 9, Issue 4, Apr 2024\r\n\r\nMovie Recommendation Engine with Sentiment Analysis, IJIRMPS, Vol. 11, Jun 2023\r\n\r\nCertifications & FDPs\r\n\r\nCompleted 18+ Faculty Development Programs (FDP/NFDP/STTP/FIP) in areas including Artificial Intelligence, Cyber Security, GenAI, AWS Cloud, Web Mining, Research Methodology, Computer Forensics, and Quality Engineering, organized by reputed institutions across India in collaboration with ExcelR Edtech, Microsoft Copilot, AWS, NSDC, and CRISP Bhopal.",
        "experience": "5+ YEARS ",
        "email": "",
        "qualification": "BE,MTECH(CSE)"
    },
    {
        "id": "5d9b47b5-f1c0-4923-8cb4-f5ed1bc46de0",
        "name": "Mr. Shashank Mane",
        "department": "AI & Data Science",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_13_2026_08_31_24_PM.png",
        "bio": "Area of Specialization :- VLSI, Artificial Intelligence, Data Science\r\nAcademic History, Research & Awards:\r\n1.\tTaught 20+ subjects\r\n2.\tAround 10 Student PG guided Students\r\nAwarded Gold Medal in M.Tech (VLSI)\r\n3.\tAttended Five International Conferences and Two National Conferences.\r\n4.\tAround 13 International Journals and 3 Scopus Indexed Journals\r\n5.\tAround 10 FDP’s, out of 2 are ATAL FDP.\r\n6.\tAttended 3 Workshops\r\n7.\tThree NPTEL Certification \r\n8.\tInternational Associations of Engineers (IAENG) – Life Time membership,   Member Number: - 131811.\r\n",
        "experience": "18+ Year",
        "email": "",
        "qualification": "BE (ETC), M.Tech(VLSI), Phd Pursuing"
    },
    {
        "id": "01b8b3ce-2a8d-456a-bc72-c23677cbbc37",
        "name": "Pramila Gharjale.",
        "department": "Computer Science & Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_14_2026_02_47_47_PM.png",
        "bio": "Area of Specialization :- AI & Machine Learning, Cryptography & Network  Security , Web technology.\r\nAcademic History: \r\nI am working as an Assistant Professor in the Department of Computer Science & Engineering with 3.9 years of teaching experience in undergraduate engineering education. I hold a Master’s degree in Computer Science and Engineering and a Bachelor’s degree in Engineering, which has provided me with a strong foundation in computing and modern technologies.\r\nThroughout my academic career, I have taught important subjects such as Python Programming, Discrete Structures, Internet & Web Technology, Machine Learning & Cloud Computing. I focus on student-centered teaching methods, practical learning, and the use of ICT tools to make concepts clear and engaging for students.\r\nIn addition to teaching, I have served as a class coordinator, mentor, and subject in-charge, guiding students in their academic progress and personal development. I have also contributed to NAAC, IQAC, and academic documentation activities in my institution.\r\nTo keep myself updated with emerging technologies and teaching practices, I regularly participate in Faculty Development Programs (FDPs), workshops, and training programs. With dedication to academic excellence and continuous learning, I strive to contribute effectively to the growth of my students and my institution.\r\n",
        "experience": "~4 year",
        "email": "",
        "qualification": "M. Tech "
    },
    {
        "id": "637654d1-f0c4-4066-b17c-cbda5db61112",
        "name": "Kanchan Narware",
        "department": "Computer Science & Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_20_2026_12_04_13_PM.png",
        "bio": "Academic History\r\n\r\nMaster of Technology (M.Tech) in Computer Science and Engineering\r\n\r\nBachelor of Engineering (B.E.) in Information Technology\r\n\r\nTeaching & Academic Experience\r\n\r\nMs. Kanchan Narware holds an M.Tech degree in Computer Science and Engineering and has over three years of teaching experience at the undergraduate level. She has been actively involved in teaching core computer science subjects and mentoring student projects.\r\n\r\nResearch Interests\r\n\r\nComputer Networks, Artificial Intelligence, Machine Learning, Web Application Development, Skill Development\r\n\r\nResearch & Publications\r\n\r\nCongestion Aware Multi-Route Establishment Routing in MANET\r\n\r\nCongestion Control Multiple Route Establishment Routing in MANET\r\n\r\nCongestion Control and Multipath Routing Techniques in MANET: A Survey\r\n\r\nImplementation of Hand Gesture Controlled Game using Machine Learning\r\n\r\nProjects & Technical Work\r\n\r\nA Modern Student Management Platform\r\n\r\nWeb-Based Online Chat Application\r\n\r\nHospital Management System\r\n\r\nDesktop Voice Assistant\r\n\r\nFreelance Web Applications\r\n\r\nProject Handling for Web-Based Applications (Freelance)\r\n\r\nInternship & Industrial Exposure\r\n\r\nSidhi Infotech Pvt. Ltd.\r\nInternship in Information Technology, assisting in technology implementation and IT solutions to support organizational operational and technological growth.\r\n\r\nCertifications & FDPs\r\n\r\nFDP in AWS Cloud Fundamentals and Services\r\n\r\nFDP in AI-Based Research Applications & Advancements in Security\r\n\r\nEntrepreneurship Development Program for Skill Enhancement\r\n\r\nAchievements & Professional Development\r\n\r\nActively participated in Faculty Development Programs, Academic Workshops, and Entrepreneurship Awareness Programs. Holds professional certifications in Python, Web Development, and Data Science, and has received academic excellence recognition for teaching and research contributions.",
        "experience": "2.8+",
        "email": "",
        "qualification": "M. tech"
    },
    {
        "id": "f8a1e0fc-c980-46bb-9580-c1085210ea66",
        "name": "Khushabu Parte",
        "department": "Computer Science & Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_20_2026_12_14_11_PM.png",
        "bio": "Area of Specialization: Programming & Scripting (Python), Data Science & Machine Learning, Data Visualization \r\nAcademic History:\r\n•\tMaster of Technology in Data Science \r\nSchool of Information & Technology, RGPV Bhopal \r\n•\tBachelor of Technology in Computer Science Engineering\r\nUniversity Institute of Technology, RGPV Bhopal\r\nResearch & Awards:\r\n•\tProjects:\r\n•\tCloud-Based Blood Donation System\r\n•\tDesktop AI Voice Assistant\r\n•\tSuperstore Market Data Analysis (Power BI)\r\n•\tData Visualization with Tableau\r\nCertificates:\r\n•\tcertifications in Data Science – by MentorKart\r\n•\tcertification in PDAC\r\n•\tSolidWrok – MSME\r\n•\tShort Term Training program on “Mozilla Add-Ons under TEQIP-3\r\n•\tOne day Workshop on Safeguards for Woman in Cyberspace –by RGPV\r\n\r\nI am Khushabu Parte, an M.Tech graduate in Data Science, with a thesis focused on using blockchain technology to enhance e-voting systems. I have recently started my teaching career, combining my academic knowledge with hands-on project experience. Throughout my academic journey, I’ve developed several projects, including a cloud-based blood donation system, a desktop AI voice assistant, and a supermarket store data visualization analysis using Power BI. I have also worked on various data-driven projects in Tableau, exploring business intelligence and analytics.\r\nIn addition to my degree, I hold certifications in Data Science, SolidWorks (from MSME), and PDAC, which have further strengthened my technical expertise. My passion lies in applying advanced technologies like AI, blockchain, CSE, and data analytics to solve real-world problems. \r\n",
        "experience": "6+ months",
        "email": "",
        "qualification": "M.Tech (Data Science) "
    },
    {
        "id": "25f3b17d-165f-45cf-bfdf-365049bd5edd",
        "name": "BHAVESH KUMAR KHASDEV",
        "department": "AI & Data Science",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_20_2026_12_23_02_PM.png",
        "bio": "Area of Specialization :- Wireless Communication, Artificial Intelligence \r\nAcademic History, Research & Awards (Maximum 200 words): \r\nBhavesh Kumar Khasdev is an academician currently serving as an Assistant Professor at Department of Artificial Intelligence & Data Science Engineering. His work primarily revolves around advanced communication systems and data-driven technologies. His research focuses on AI integration on next-generation telecommunications and computational intelligence, specifically Wireless Communication: Exploring 5G, 6G, and beyond.\r\nPublications\r\nMr. Bhavesh Khasdev has contributed to several international journals. Notable works include:\r\n•\tOverview of MIMO Technology in LTE, LTE-A & LTE-A-Pro (International Journal of Engineering and Computer Science, 2016).\r\n•\tPerformance Analysis of Adaptive MIMO OFDM System (International Journal of Advanced Research in Electronics and Communication Engineering, 2016).\r\n•\tWeb-Based Smart Skills and Job Role Mapping System using Data Science and Machine Learning (International Journal of Leading Research Publication, 2025).\r\n•\tA Comprehensive Study on Text Detection and Extraction from Images and PDF Documents (International Journal of Innovative Research in Engineering, 2025).\r\nExperience & Activities\r\n•\tTeaching Experience: He holds a Dean Academics and Assistant Professor position at SBITM Betul, where he engages in undergraduate instruction since last 14 years.\r\n•\tProjects: His recent project work involves the development of automated systems for text extraction and smart job mapping using modern AI techniques.\r\n•\tWorkshops & Seminars: Participation in more than 20 AICTE approved FDPs in the latest trends in Engineering and Data Science research.\r\nAcademic awards or recognitions \r\n•\tRecipient of SRIJAN Best Teacher Award for teaching excellence.\r\n•\tNDLI Club President.\r\n",
        "experience": "14+Years ",
        "email": "",
        "qualification": "P.hD Pursuing, M.E, B.E in Electronics & Communication Engineering"
    },
    {
        "id": "8d83a253-e16a-4e1c-9f92-c62ff1d66ba1",
        "name": "SATISH CHADOKAR",
        "department": "Computer Science & Engineering",
        "role": "Faculty",
        "designation": "ASSISTANT PROFESSOR",
        "image": "",
        "bio": "",
        "experience": "",
        "email": "",
        "qualification": ""
    },
    {
        "id": "ff4eb56d-ad9a-454b-9ff1-ff2c71595d74",
        "name": "Ashish Gawande",
        "department": "AI & Data Science",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "",
        "bio": "Area of Specialization - Machine Learning And Cyber law And Information Technology \r\nAcademic History - I am a faculty member in the Department of  Artificial Intelligence And Data Science SBITM, BETUL with 3.3 years of experience in academics. I hold a Master’s degree in Cyber Law and Information Technology from IIIT Allahabad. My research interests include Machine Learning, Deep Learning, and Information Security. My focus is on integrating research-driven learning with practical applications in engineering education.",
        "experience": "3 years  3month",
        "email": "",
        "qualification": "Bachelor of Engineering from Jabalpur Engineering   College, Jabalpur  , Master of Technology from IIIT Allahabad"
    },
    {
        "id": "4161ebe8-962f-45fb-a6ba-48c30b7e0f68",
        "name": "Rajesh Barange ",
        "department": "Mechanical Engineering",
        "role": "HOD",
        "designation": "HEAD OF DEPARTMENT",
        "image": "ChatGPT_Image_Jan_20_2026_01_01_03_PM.png",
        "bio": "Mr. Rajesh Barange  is an Assistant Professor and Head of the Department of Mechanical Engineering with over 15 years of teaching experience and one year of industrial experience  in a steel plant, which strengthens his practical approach to teaching.\r\n\r\nHe completed his B.E. in Mechanical Engineering from SSSIST, Sehore  and M.Tech in Mechanical Engineering with specialization in Computer Integrated Manufacturing (CIM) from SATI, Vidisha. His M.Tech thesis was carried out at CSIR–Advanced Materials and Processes Research Institute (AMPRI), Bhopal. He also holds a Post Graduate Diploma in CAD/CAM/CIM from the Indo-German Tool Room, Indore.\r\n\r\nHe has contributed significantly to academic administration as Head of Department, Departmental Training & Placement Coordinator, NAAC Criteria Coordinator,member of examination cell and member of various institutional committees. His areas of interest include Additive Manufacturing, Advanced Manufacturing Processes, CNC Technology, and CAD/CAM/CIM.\r\n\r\nHe has guided several undergraduate projects, published research papers in reputed international journals, and actively participates in AICT approved STTPs and FDPs. He promotes industry–institute interaction through industrial visits. He is a member of IAENG, IFERP, and IAAC.\r\n",
        "experience": "15 year",
        "email": "",
        "qualification": "M. TECH "
    },
    {
        "id": "fbdae78b-22c2-46f7-8b8b-5273d715b1e9",
        "name": "ALOK NAGLE",
        "department": "Mechanical Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "Gemini_Generated_Image_3qiqqb3qiqqb3qiq.png",
        "bio": "Area of Specialization : Thermal Engineering \r\n\r\nAcademic History, \r\n \r\nAlok Nagle holds a Bachelor’s degree in Mechanical Engineering and an M.Tech in Thermal Engineering. He is an Assistant Professor at Shri Balaji Institute of Technology and Management, Betul, with teaching experience in core mechanical and thermal engineering subjects. His research interests include thermal engineering, heat transfer, refrigeration and air conditioning, plate heat exchangers, sustainable energy systems, and phase change materials. He completed his postgraduate project on thermal analysis of pressure drop in plate heat exchangers. He has participated in AICTE–ATAL and industry-sponsored faculty development programs and actively engages in workshops, seminars, and academic activities.\r\nResearch paper Work \r\nPERFORMANCE INVESTIGATION OF A WINDOW AIR CONDITIONER OPERATING WITH R-22 REFRIGERANT\r\nPAPER ID : IJCRT25A4287\r\nExperimental Investigation of Alternative Gases in Domestic Electrolux\r\nPAPER ID : IJCRT25A3395\r\nExperimental Investigations of Rockwell Hardness Test\r\nPAPER ID : IJCRT24A4856\r\nRefrigeration Systems: Performance, Efficiency, and Environmental Impact\r\nPAPER ID : IJCRT25A3395\r\n",
        "experience": "3+ year",
        "email": "",
        "qualification": "M-Tech"
    },
    {
        "id": "b6901ff0-bfe0-4056-a0e2-535dd0015e3c",
        "name": "Omkar Dhurwey",
        "department": "Mechanical Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_20_2026_01_22_21_PM.png",
        "bio": "Area of Specialization :- HP&TE\r\nAcademic History: OMKAR DHURWEY holds a Bachelor’s degree in Mechanical Engineering and an M.Tech in Heat Power &Thermal Engineering. He is an Assistant Professor at Shri Balaji Institute of Technology and Management, Betul,( M.P.) wiith +4 Year teaching experience in core mechanical and thermal engineering subjects. His research interests include Thermal engineering, heat and Mass Transfer, refrigeration and air conditioning, Thermal Engineering & Gas Dynamics. He completed his postgraduate project on Investigation and use of BS VI fuel. He has participated in AICTE–ATAL and industry-sponsored faculty development programs and actively engages in workshops, + 5 international journals and has presented +7 papers in national conferences,seminars.",
        "experience": "+4 Year",
        "email": "",
        "qualification": "M.Tech"
    },
    {
        "id": "ebaab936-2df8-4a3c-9040-a74c50d6b899",
        "name": "Ms. Meena Sune",
        "department": "Electrical Engineering",
        "role": "Faculty",
        "designation": "Assistant Professor",
        "image": "ChatGPT_Image_Jan_20_2026_01_25_50_PM.png",
        "bio": "Area of Specialization :- Digital communication\r\nAcademic History\r\nMs. Meena Sune is an accomplished Assistant Professor in the Department of Electrical & Electronics Engineering with over 13 years of academic experience. She holds an M. Tech degree in Digital Communication from Shri Balaji Institute of Technology & Management, Betul, affiliated to RGPV Bhopal, which she completed 10 years ago. She also completed her B. Tech in Electronics & Communication Engineering from Royal College of Technology, Indore, also affiliated with RGPV Bhopal.\r\nMs. Sune is passionate about digital communication and has specialized expertise in this field. Alongside her academic qualifications, she has actively pursued various certifications to enhance her skills and knowledge. She completed certifications in areas like Universal Human Values from AICTE, Computer Forensics and Cyber Crime from Sadabai Raisoni Women’s College, and Research Methodology from Kamla Nehru Mahavidyalaya, Nagpur. Additionally, she has participated in programs related to Emerging Trends in Science, Engineering, Technology, Humanity, and Management, and AI-Based Research Application & Advancement from SBITM, Betul.\r\nHer interest in emerging technologies is reflected in her certifications in AWS Cloud Fundamentals from Sinhgad Institute of Technology, Lonavala, and she is also a Certified Master Trainer in Drone Service Technician (ELE/Q7003) - v3.0. Ms. Sune’s commitment to continuous learning and professional development ensures she remains at the forefront of technological advancements in the academic world.\r\n",
        "experience": "13+ year",
        "email": "",
        "qualification": "M. Tech"
    },
    {
        "id": "317c8bcb-b00e-4836-a6f9-3e55af70f423",
        "name": "Mr. Kapil Padlak",
        "department": "Electrical Engineering",
        "role": "HOD",
        "designation": "Assistant Professor",
        "image": "",
        "bio": "Area of Specialization :- Power Electronics\r\nAcademic History\r\nKapil Padlak is an academic professional with a strong background in electrical and power electronics engineering. He completed his Bachelor of Technology (B.Tech) in Electrical and Electronics Engineering, where he gained a solid foundation in electrical systems, machines, power systems, and electronics. Building on this undergraduate training, he pursued a Master of Technology (M.Tech) in Power Electronics, specializing in advanced power conversion techniques, power semiconductor devices, and energy-efficient electrical systems.\r\nWith over 10 years of teaching experience, Kapil Padlak has been actively involved in undergraduate and postgraduate engineering education. His teaching career reflects consistent engagement in delivering core and advanced subjects related to electrical engineering and power electronics, along with mentoring students in academic and practical domains.\r\nHe has demonstrated a strong commitment to professional development by participating in numerous ATAL and other Faculty Development Programmes (FDPs), which have enhanced his pedagogical skills, technical knowledge, and exposure to emerging technologies. In addition, he holds a certification as a Battery System Repair Technician(ELE/Q7001)-V2.0 conforming to NSQF Level-4, reflecting his practical expertise and interest in applied aspects of energy storage systems and battery technologies.\r\nThrough his academic qualifications, teaching experience, continuous training, and technical certifications, Kapil Padlak has developed a well-rounded academic profile that integrates theoretical knowledge with practical and industry-relevant skills\r\n",
        "experience": "10 Years",
        "email": "",
        "qualification": "M. Tech"
    },
    {
        "id": "197463f9-2826-4fe2-85c8-05013c6a1195",
        "name": "Hemant Kumar Badode",
        "department": "Civil Engineering",
        "role": "HOD",
        "designation": "Assistant Professor",
        "image": "",
        "bio": "Area of Specialization :- Construction Technology Management\r\nAcademic History\r\n\r\nI am currently serving as an Assistant Professor in the Department of Civil Engineering at Shri Balaji Institute of Technology & Management (SBITM), Betul, with 13 years of comprehensive teaching experience. I completed my Bachelor of Engineering (B.E.) in 2012 from Bansal Institute of Science and Technology, Bhopal, and subsequently earned my Master of Technology (M.Tech) degree in 2017 from Rabindranath Tagore University (RNTU), Bhopal.\r\n\r\nMy postgraduate research work, titled “Enhancement of Soil Stabilisation with the Help of Stone Dust,” reflects my expertise in Geotechnical Engineering and the application of sustainable construction materials. My broader research interests include Environmental Engineering and advanced Geospatial Technologies such as Remote Sensing and GIS.\r\n\r\nI am committed to continuous academic and professional development and have successfully completed the AICTE ATAL Academy Online Elementary FDP on “Remote Sensing, GIS, GPS Technologies” organized by Ujjain Engineering College. I have also participated in a Short-Term Course at NIT Jalandhar on “Challenges in Wastewater, Air, and Land Pollution in India.”\r\n\r\nWith over a decade of academic experience, I am dedicated to fostering holistic student development by integrating core civil engineering principles with emerging technologies and contemporary engineering practices.",
        "experience": "13 Years",
        "email": "",
        "qualification": "M. Tech"
    }
]